#!/usr/bin/env python
import sys
sys.path.append('/Users/djb/collatex/collatex-pythonport')  # CollateX from repo; not installed
from collatex import *

jsonInput = {
    "witnesses"
:
    [{
        "id": "Lav",
        "tokens": [{"n": "с", "t": "Се"}, {"n": "пвст", "t": "повѣсти"}, {
            "n": "врмн",
            "t": "времѧньны<sup>х</sup>"
        }, {"n": "лт", "t": "лѣ<sup>т</sup>. <pageRef>1v</pageRef>"}]
    }, {
        "id": "Tro",
        "tokens": [{"n": "с", "t": "се"}, {"n": "пвст", "t": "повѣсти"}, {"n": "врмн", "t": "временьныхъ"}, {
            "n": "лт",
            "t": "лѣтъ <pageRef>51</pageRef>"
        }]
    }, {
        "id": "Rad",
        "tokens": [{"n": "пвст", "t": "повесть"}, {"n": "врмн", "t": "временны<sup>х</sup>"}, {
            "n": "лт",
            "t": "лѣтъ"
        }, {"n": "чрнр", "t": "черноризца"}, {"n": "фдсв", "t": "феѡдось<lb/>ева <pageRef>1v</pageRef>"}]
    }, {
        "id": "Aka",
        "tokens": [{"n": "пвст", "t": "Повѣсть"}, {"n": "врмн", "t": "временны<sup>х</sup>"}, {
            "n": "лт",
            "t": "лѣтъ."
        }, {"n": "чрнр", "t": "черноризца"}, {"n": "фдсв", "t": "феѡдосьева. <pageRef>1r</pageRef>"}]
    }, {
        "id": "Ipa",
        "tokens": [{"n": "пвст", "t": "повѣсть"}, {"n": "врмн", "t": "временныхъ"}, {
            "n": "лт",
            "t": "лѣ<sup>т</sup>."
        }, {"n": "чрнр", "t": "че<lb/>рноризца"}, {"n": "фдсв", "t": "федосьева <pageRef>3a</pageRef>"}]
    }, {
        "id": "Xle",
        "tokens": [{"n": "пвст", "t": "Пѡвѣсти"}, {"n": "врмн", "t": "врѣменны<sup>х</sup>"}, {
            "n": "лт",
            "t": "лѣ<sup>т</sup>."
        }, {"n": "нстр", "t": "нестера"}, {"n": "чрнр", "t": "черноризца.<lb/>"}, {
            "n": "фдсв",
            "t": "фе<sup>д</sup>ѡ<sup>о</sup>сїева <pageRef>2r</pageRef>"
        }]
    }, {
        "id": "Bych",
        "tokens": [{"n": "с", "t": "СЕ"}, {"n": "пвст", "t": "ПОВѢСТИ"}, {"n": "врмн", "t": "ВРЕМЯНЬНЫХЪ"}, {
            "n": "лт",
            "t": "ЛѢТЪ,"
        }]
    }, {
        "id": "Shakh",
        "tokens": [{"n": "с", "t": "Се"}, {"n": "пвст", "t": "повѣсти"}, {"n": "врмн", "t": "временьныхъ"}, {
            "n": "лт",
            "t": "лѣтъ,"
        }]
    }, {
        "id": "Likh",
        "tokens": [{"n": "с", "t": "СЕ"}, {"n": "пвст", "t": "ПОВѢСТИ"}, {"n": "врмн", "t": "ВРЕМЯНЬНЫХ"}, {
            "n": "лт",
            "t": "ЛѢТЪ,"
        }]
    }, {
        "id": "Ost",
        "tokens": [{"n": "пвст", "t": "Повѣсть"}, {"n": "врмн", "t": "временьныхъ"}, {
            "n": "лт",
            "t": "лѣтъ"
        }, {"n": "чрнр", "t": "чьрноризьца"}, {"n": "фдсв", "t": "Феодосиева"}]
    }]
}
table = collate(jsonInput, segmentation=False, near_match=True)
print(table)